In [1]:
# Priint more than 1 output within the same cell

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
# Importing all dedicated libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import shapiro
from scipy import stats
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn import linear_model
from sklearn.metrics import r2_score
from sklearn.metrics import mean_squared_error
import math
from sklearn.preprocessing import PowerTransformer

In [3]:
# Print whole df if necessary

pd.set_option('display.max_rows', 50)

In [4]:
# Reading files into a DF

df = pd.read_csv('./dataset/fifa21_training.csv')

df[['W/F',
 'SM',
 'A/W',
 'D/W',
 'IR',]]

df['IR'].value_counts()
df['SM'].value_counts()

In [5]:
# Unpivoting the df to get the value for each player and in the best position

df_melt= df.melt(id_vars= ['Unnamed: 0',
 'ID',
 'Name',
 'Age',
 'Nationality',
 'Club',
 'BP',
 'Position',
 'Team & Contract',
 'Height',
 'Weight',
 'foot',
 'Growth',
 'Joined',
 'Loan Date End',
 'Value',
 'Wage',
 'Release Clause',
 'Contract',
 'Attacking',
 'Crossing',
 'Finishing',
 'Heading Accuracy',
 'Short Passing',
 'Volleys',
 'Skill',
 'Dribbling',
 'Curve',
 'FK Accuracy',
 'Long Passing',
 'Ball Control',
 'Movement',
 'Acceleration',
 'Sprint Speed',
 'Agility',
 'Reactions',
 'Balance',
 'Power',
 'Shot Power',
 'Jumping',
 'Stamina',
 'Strength',
 'Long Shots',
 'Mentality',
 'Aggression',
 'Interceptions',
 'Positioning',
 'Vision',
 'Penalties',
 'Composure',
 'Defending',
 'Marking',
 'Standing Tackle',
 'Sliding Tackle',
 'Goalkeeping',
 'GK Diving',
 'GK Handling',
 'GK Kicking',
 'GK Positioning',
 'GK Reflexes',
 'Total Stats',
 'Base Stats',
 'W/F',
 'SM',
 'A/W',
 'D/W',
 'IR',
 'PAC',
 'SHO',
 'PAS',
 'DRI',
 'DEF',
 'PHY',
 'Hits','OVA'], value_vars= ['LS',
 'ST',
 'RS',
 'LW',
 'LF',
 'CF',
 'RF',
 'RW',
 'LAM',
 'CAM',
 'RAM',
 'LM',
 'LCM',
 'CM',
 'RCM',
 'RM',
 'LWB',
 'LDM',
 'CDM',
 'RDM',
 'RWB',
 'LB',
 'LCB',
 'CB',
 'RCB',
 'RB',
 'GK'])

In [6]:
df_m= df_melt[df_melt['BP']== df_melt['variable']]

In [7]:
df_m.head()

,Unnamed: 0,ID,Name,Age,Nationality,Club,BP,Position,Team & Contract,Height,...,PAC,SHO,PAS,DRI,DEF,PHY,Hits,OVA,variable,value
13701,2225,188044,Alan Carvalho,30,China PR,Beijing Sinobo Guoan FC,ST,ST LW LM,"Beijing Sinobo Guoan FC Dec 31, 2020 On Loan","6'0""",...,83,75,68,82,33,71,44,77,ST,77+0
13718,5168,209709,B. Edomwonyi,25,Nigeria,FK Austria Wien,ST,ST LM,FK Austria Wien 2018 ~ 2022,"6'1""",...,85,62,52,67,29,71,6,66,ST,66+2
13722,12279,242250,G. Verón,18,Argentina,Argentinos Juniors,ST,ST,Argentinos Juniors 2018 ~ 2021,"6'0""",...,63,57,44,58,30,58,4,59,ST,58+2
13724,4707,206263,T. Hopper,26,England,Lincoln City,ST,ST,Lincoln City 2020 ~ 2023,"6'1""",...,63,62,52,61,34,73,7,63,ST,63+2
13728,4229,203757,Zé Luís,29,Cape Verde,FC Porto,ST,ST,FC Porto 2019 ~ 2023,"6'0""",...,80,75,59,75,33,80,89,77,ST,77+0

In [8]:
# Selecting only certain variables to work with

red_df= df_m[['Name', 'Growth', 'Value', 'Wage', 'Total Stats', 'Base Stats', 'OVA', 'value', 'IR']]

In [9]:
# Organizing the df

red_df= red_df[['Name', 'Wage', 'Value', 'Growth', 'value', 'Base Stats', 'Total Stats', 'IR', 'OVA']]

In [10]:
red_df.head()

,Name,Wage,Value,Growth,value,Base Stats,Total Stats,IR,OVA
13701,Alan Carvalho,€23K,€8.5M,0,77+0,412,1961,2 ★,77
13718,B. Edomwonyi,€6K,€825K,3,66+2,366,1656,1 ★,66
13722,G. Verón,€900,€325K,17,58+2,310,1428,1 ★,59
13724,T. Hopper,€3K,€475K,3,63+2,345,1626,1 ★,63
13728,Zé Luís,€16K,€9M,0,77+0,402,1889,1 ★,77

In [11]:
# Standarazing headers

red_df.columns= red_df.columns.str.lower().str.replace(' ','_')
#red_df.head(1)

In [12]:
red_df.columns
red_df.columns= ['name', 'wage', 'value', 'growth', 'bp_stats', 'base_stats', 'total_stats', 'ir', 'ova']

Index(['name', 'wage', 'value', 'growth', 'value', 'base_stats', 'total_stats',
       'ir', 'ova'],
      dtype='object')

In [13]:
red_df.head(2)

,name,wage,value,growth,bp_stats,base_stats,total_stats,ir,ova
13701,Alan Carvalho,€23K,€8.5M,0,77+0,412,1961,2 ★,77
13718,B. Edomwonyi,€6K,€825K,3,66+2,366,1656,1 ★,66

In [14]:
# Standarizing data and converting to correct type

red_df['wage']= red_df['wage'].str.replace('€', '').str.replace('K', '000').str.replace('M', '000000').str.replace('.','').str.replace('★','')
red_df['value']= red_df['value'].str.replace('€', '').str.replace('K', '000').str.replace('M', '000000').str.replace('.','').str.replace('★','')
red_df['bp_stats']= red_df['bp_stats'].str.replace('€', '').str.replace('K', '000').str.replace('M', '000000').str.replace('.','').str.replace('★','')
red_df['ir']= red_df['ir'].str.replace('€', '').str.replace('K', '000').str.replace('M', '000000').str.replace('.','').str.replace('★','')

In [15]:
red_df['bp_stats']= red_df['bp_stats'].apply(lambda x : x.split('+')[0])

In [16]:
red_df.head(2)

,name,wage,value,growth,bp_stats,base_stats,total_stats,ir,ova
13701,Alan Carvalho,23000,85000000,0,77,412,1961,2,77
13718,B. Edomwonyi,6000,825000,3,66,366,1656,1,66

In [17]:
red_df[['wage', 'value', 'bp_stats', 'ir']] = red_df[['wage', 'value', 'bp_stats', 'ir']].astype(int)

In [18]:
red_df.dtypes

name           object
wage            int64
value           int64
growth          int64
bp_stats        int64
base_stats      int64
total_stats     int64
ir              int64
ova             int64
dtype: object

In [19]:
# Checking missing vals

red_df.isnull().sum()

name           0
wage           0
value          0
growth         0
bp_stats       0
base_stats     0
total_stats    0
ir             0
ova            0
dtype: int64

In [20]:
df_num= red_df.select_dtypes(include= np.number)
#df_cat= df.select_dtypes(include= np.cat)

In [21]:
# Data Visualization and standarization

In [22]:
df_num.head()

        wage     value  growth  bp_stats  base_stats  total_stats  ir  ova
13701  23000  85000000       0        77         412         1961   2   77
13718   6000    825000       3        66         366         1656   1   66
13722    900    325000      17        58         310         1428   1   59
13724   3000    475000       3        63         345         1626   1   63
13728  16000   9000000       0        77         402         1889   1   77

In [23]:
y = df_num['ova']
X = df_num.drop(['ova'], axis=1)

In [38]:
# Scaling variables

MinMaxtransformer = MinMaxScaler().fit(df_num)
x_normalized = MinMaxtransformer.transform(df_num)
x_normalized.shape
x_normalized = pd.DataFrame(x_normalized,columns=df_num.columns)
x_normalized.head(2)

(13700, 8)

,wage,value,growth,bp_stats,base_stats,total_stats,ir,ova
0,0.041071,0.117241,0.037037,0.722222,0.681481,0.781945,0.25,0.709091
1,0.010714,0.001138,0.148148,0.518519,0.511111,0.588048,0.00,0.509091

In [44]:
Standardtransformer = StandardScaler().fit(df_num)
x_standardized = Standardtransformer.transform(df_num)
x_standardized.shape
x_standardized = pd.DataFrame(x_standardized,columns=df_num.columns)
x_standardized.head(2)

(13700, 8)

,wage,value,growth,bp_stats,base_stats,total_stats,ir,ova
0,0.596462,1.829558,-0.950485,1.539813,1.258988,1.267915,1.868479,1.465624
1,-0.210995,-0.376523,-0.432973,-0.078048,0.116328,0.099228,-0.329165,-0.137889

In [45]:
X.head(2)
y.head(2)

        wage     value  growth  bp_stats  base_stats  total_stats  ir
13701  23000  85000000       0        77         412         1961   2
13718   6000    825000       3        66         366         1656   1

13701    77
13718    66
Name: ova, dtype: int64

In [53]:
# Splitting and training the model

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.25, random_state=1000)

In [47]:
lm = linear_model.LinearRegression()
model = lm.fit(X_train,y_train)

In [54]:
predictions = lm.predict(X_test)
r2_score(y_test, predictions)

0.9823983548752125

In [30]:
mse = mean_squared_error(y_test, predictions)
print(mse)

0.967790679596279

In [31]:
rmse = math.sqrt(mse)
print(rmse)

0.9837635282913668

In [32]:
r2 = r2_score(y_test, predictions)
r2

0.9789931276465981

 if type(x) == str:
        return x.replace("€"," ")
    else:
        return float(x)

#using regular expressions to find M and K, and then replace them
from re import search

subs1 ="K"
subs2 ="M"
def conv_float_M_or_K(x):
    if type(x) == str:
        if search(subs2,x):
            x=x.replace("M"," ")
            return float(x)*1000000
        elif search(subs1,x):
            x=x.replace("K"," ")
            return float(x)*1000
        else:
            return float(x)
    else:
        return float(x)

red_df['Value'] = list(map(remove_euro_symbol,df['Value']))

red_df['Value'].head(2)